data/pretrain/LogGPTV2_20240403_110829/filter2aa_278.txt

### TR-069 Security: A Comprehensive Overview

#### Presenter Information
- **Name**: Shahar Tal (@jifa)
- **Role**: Father, Husband, Geek
- **Experience**: 10 years with IDF

**Note**: No ISPs were harmed during the making of this presentation. Corporate legal wouldn't let us.

#### Introduction to Residential Gateway Security
- **Current State**: The security of residential gateways is generally poor.
- **Notable Research**:
  - Pedro Joaquin (Routerpwn)
  - Jacob Holcomb ("So hopelessly broken")
  - Zachary Cutlip ("rooting SOHO")
  - devtty0 (D-Link "joel’s backdoor" and more)

#### Understanding TR-069
- **CPE WAN Management Protocol (CWMP/TR-069)**: 
  - **SOAP RPC**: XML over HTTP
  - **Session Initiation**: Always* initiated by the CPE
  - **Authentication**: Dual authentication mechanism

**Example RPC (ACSCPE)**
```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <cwmp:ID soapenv:mustUnderstand="1" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">1337069</cwmp:ID>
   </soapenv:Header>
   <soapenv:Body>
      <cwmp:GetParameterValues>
         <ParameterNames soapenc:arrayType="xsd:string[1]">
            <string>InternetGatewayDevice.ManagementServer.URL</string>
         </ParameterNames>
      </cwmp:GetParameterValues>
   </soapenv:Body>
</soapenv:Envelope>
```

**Response**
```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <cwmp:ID soapenv:mustUnderstand="1" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">1337069</cwmp:ID>
   </soapenv:Header>
   <soapenv:Body>
      <cwmp:GetParameterValuesResponse>
         <ParameterValueStruct>
            <Name>InternetGatewayDevice.ManagementServer.URL</Name>
            <Value>http://acs.supersecureisp.com/cwmp/</Value>
         </ParameterValueStruct>
      </cwmp:GetParameterValuesResponse>
   </soapenv:Body>
</soapenv:Envelope>
```

#### TR-069 Deployment
- **Statistics** (2011):
  - Estimated 147 million TR-069 enabled devices online
  - 70% are gateways
  - According to zmap, port 7547 is open on 1.12% of IPv4 addresses
  - 2nd most popular open port in the world

#### Benefits of ACS
- **Monitoring**: Faults, errors, and malicious activity
- **Performance Measurement**
- **Remote Management**: Allows Tech Support to assist users
- **Configuration Fixes**: Replace or fix faulty configurations
- **Firmware Updates**: Deploy upgraded firmware

#### Architecture and Security Implications
- **Architecture**:
  - Internet-facing HTTP servers
  - Non-trivial connectivity to internal ISP assets
- **Why Intelligence Agencies Should Care**: Because intelligence agencies do.
- **Risks of Compromised ACS**:
  - Access to private data (SSID, hostnames, MAC addresses, usernames, VoIP)
  - Complete configuration including passwords
  - Manipulation of parameters (DNS, Wi-Fi, PPP)
  - Download and upload of configurations, firmware, and logs

#### Previous Research
- **Luka Perkov**: "ISP’s black box" @ 29c3, UKNOF24
- **3SLabs**: A brief survey of CWMP security
  - [Blog Post](http://blog.3slabs.com/2012/12/a-brief-survey-of-cwmp-security.html)

#### TR-069 Community
- **Service Providers**:
  - ADB, Affinegy, Agile ACS, Alvarion, Arris, AVSystem, Axiros, Calix, Cisco, Comtrend, Consona, Dimark, Draytek, Fine Point Technologies, Friendly Tech, GIP, Incognito Software, Intraway, Iskratel, iWedia, Jungo, Juniper Bridge, Mobigen, Motive, Netgem communications, Netmania, OneAccess, Pace, ProSyst, Ronankii Infotech, Sigma Systems, Tata Elxsi, Tilgin, Wi-tribe, Wind River, Works Systems

#### Security Challenges
- **Insecure Configuration**
- **Insecure Implementation**

#### Finding ACSs in the Wild
- **Methods**:
  - Hack a single router
  - Scanning (zmap/masscan for port 7547 and related ports)
  - UPnP endpoints
  - Public datasets (Internet Census 2012, DNS Census 2013)
  - lmgtfy (Let Me Google That For You)

#### Insecure Configuration
- **Perimeter Security**: Poor or non-existent
- **Misunderstanding of Architecture**

#### Authentication Mechanisms
- **SSL or Shared Secret**
- **Shared Secret**: HTTP Basic/Digest auth
- **HTTP vs. HTTPS**:
  - HTTP: 81%
  - HTTPS: 19%

#### Stealing the Secret
- **Router Interfaces**: Protect ACS passwords but allow changing the ACS URL
- **ACS Enforces HTTP Basic Auth**: Base64 encoded "username:password"

#### SSL Certificate Validation
- **Field Test**: OpenACS and GenieACS
  - **OpenACS** (Java): RCE after 3 days (CVE-2014-2840)
  - **GenieACS** (Node.js, Redis, MongoDB): RCE after 2 days (Non-Global regex, running as root)

**Example Exploit**
```bash
GET /devices?query=["./;require('util').log(‘lolwut');//*"] HTTP/1.1
```

#### Real-World Incident
- **Scanning for GenieACS**: Detected instance in an Iraqi ISP
- **Vulnerability Report**: Delivered to the ISP, which was not thrilled with an Israeli calling about "vulnerable infrastructure"
- **Outcome**: 8/10 would report again

#### Mitigation Strategies
- **Audit TR-069 Settings**
- **Ensure SSL and Proper Cert Validation**
- **Disable TR-069 if Unsatisfied**
- **Add Home Security Layer**: Another router with NAT/FW capabilities
- **Use Open Source Firmware Alternatives**
- **Ask Your Provider About Their TR-069 Configuration**

#### Fixing the Problem
- **Long-Term Process**: Bad implementations exist, and TR-069 needs to mature
- **Awareness is Key**: Security community, ACS vendors, and service providers must collaborate
- **Certification and Bug Bounties**: Encourage better software and secure coding practices

#### Additional Resources
- **TR-069 Crash Course**: [University of New Hampshire Interoperability Laboratory](https://www.iol.unh.edu/sites/default/files/knowledgebase/hnc/TR-069_Crash_Course.pdf)
- **Security Flaws in Universal Plug and Play**: [Rapid7 Whitepaper](https://community.rapid7.com/servlet/JiveServlet/download/2150-1-16596/SecurityFlawsUPnP.pdf)
- **Internet Census 2012**: [Anonymous Researcher](http://internetcensus2012.bitbucket.org/)
- **SOHO Pharming**: [Team Cymru](http://www.team-cymru.com/ReadingRoom/Whitepapers/SOHOPharming.html)

#### Questions and Further Directions
- **Stay tuned for CCC (Chaos Communication Congress)**
- **Questions?**